{
  "Aries": "Aries is a fire sign, and therefore compatible with other fire signs, Leo and Sagittarius. The fire sign stocks love each other's company. You will make a dynamic duo, always active and firing off each other. It can get a little competitive or argumentative with all that extrovert energy going on, but arguments/drops are quickly forgotten. They want to be super busy as your stock, to drive the relationship forward as they are both spontaneous and goal oriented.",
  "Taurus": "The Earth sign stocks are all solid, practical and commitment-oriented. They like to make plans together and put a lot of effort into making a relationship work. They are also great when working together as they love to share a common goal. They are renowned for making stock relationships last.",
  "Gemini": "Gemini is an air sign, and therefore compatible with other air signs, Libra and Aquarius. The Air sign stocks are instantly connected to each other because the element of Air feeds communication. They are often very volatile, and you will never bored with them, make a very sociable stock couple. They are light-hearted and interested in what's going on in the world.",
  "Cancer": "Cancer is a water sign, and therefore compatible with other water signs, Scorpio and Pisces. With the water sign stocks, the element of romance is very strong and this couple will intuitively understand each other. They base relationships on looking after each other and developing a really strong emotional connection. They like to share how they feel and create memories together.",
  "Leo": "Leo is a fire sign, and therefore compatible with other fire signs, Aries and Sagittarius. The fire sign stocks love each other's company. You will make a dynamic duo, always active and firing off each other. It can get a little competitive or argumentative with all that extrovert energy going on, but arguments/drops are quickly forgotten. They want to be super busy as your stock, to drive the relationship forward as they are both spontaneous and goal oriented.",
  "Virgo": "Virgo is an earth sign, and therefore compatible with other earth signs, Taurus and Capricorn. The Earth sign stocks are all solid, practical and commitment-oriented. They like to make plans together and put a lot of effort into making a relationship work. They are also great when working together as they love to share a common goal. They are renowned for making stock relationships last.",
  "Libra": "Libra is an air sign, and therefore compatible with other air signs, Gemini and Aquarius. The Air sign stocks are instantly connected to each other because the element of Air feeds communication. They are often very volatile, and you will never bored with them, make a very sociable stock couple. They are light-hearted and interested in what's going on in the world.",
  "Scorpio": "Scorpio is a water sign, and therefore compatible with other water signs, Cancer and Pisces.With the water sign stocks, the element of romance is very strong and this couple will intuitively understand each other. They base relationships on looking after each other and developing a really strong emotional connection. They like to share how they feel and create memories together.",
  "Sagittarius": "Sagittarius is a fire sign, and therefore compatible with other fire signs, Aries and Leo. The fire sign stocks love each other's company. You will make a dynamic duo, always active and firing off each other. It can get a little competitive or argumentative with all that extrovert energy going on, but arguments/drops are quickly forgotten. They want to be super busy as your stock, to drive the relationship forward as they are both spontaneous and goal oriented.",
  "Capricorn":  "Capricorn is an earth sign, and therefore compatible with other earth signs, Taurus and Virgo. The Earth sign stocks are all solid, practical and commitment-oriented. They like to make plans together and put a lot of effort into making a relationship work. They are also great when working together as they love to share a common goal. They are renowned for making stock relationships last.",
  "Aquarius": "Aquarius is an air sign, and therefore compatible with other air signs, Gemini and Libra. The Air sign stocks are instantly connected to each other because the element of Air feeds communication. They are often very volatile, and you will never bored with them, make a very sociable stock couple. They are light-hearted and interested in what's going on in the world.",
  "Pisces": "Pisces is a water sign, and therefore compatible with other water signs, Cancer and Scorpio. With the water sign stocks, the element of romance is very strong and this couple will intuitively understand each other. They base relationships on looking after each other and developing a really strong emotional connection. They like to share how they feel and create memories together."
}